{
    "Home": {
        "iam": {
            "header": "I'm Methit Sompitak",
            "position": "Computer engineer"
        }
    },
    "aboutMe": [
        {
            "header": "",
            "content": "สวัสดีทุกคนที่หลงมา, ผมเมธิส สมพิทักษ์ วิศวกรคอมพิวเตอร์ที่สนใจใน Programing และ Infrastructure, ผมเคยมีประสบการณ์พัฒนา Sofware ในงานจากการเรียนมหาวิทยาลัยและการเขียนเล่น แม้จะไม่มีประสบการณ์ทำงานจากการฝึกงานเพราะไม่ได้ฝึกในตำแหน่งที่ต้องเขียน และค่อนข้างมั่นใจในการแก้ไขปัญหา มีความรับผิดชอบ การจัดการเวลาและชื่นชอบที่จะเรียนรู้สิ่งใหม่ๆ แม้ว่าจะไม่เก่งเรื่องการคุยสัพเพเหระ แต่ผมมีพร้อมรับฟังสิ่งต่างๆและยินดีที่จะพูดคุยกับทุกคน"
        },
        [
            {
                "header": "งานอดิเรก",
                "content": [
                    "ฟังเพลง", "เล่นเกม", "อ่านหนังสือการ์ตูน", "ดูการ์ตูน", "เล่นดนตรี"
                ]
            },
            {
                "header": "จุดเด่น",
                "content": [
                    "การแก้ไขปัญหา", "ชอบเรียนรู้สิ่งใหม่ๆ", "การจัดการเวลา", "ความรับผิดชอบ", "รับฟังความคิดเห็นที่แตกต่าง", "การคิดวิพากษ์"
                ]
            },
            {
                "header": "จุดด้อย",
                "content": [
                    "การเริ่มบทสนทนา", "คิดมาก", "ไม่ค่อยมีความมั่นใจ", "การพูดในที่สาธารณะ"
                ]
            }
        ]
    ],
    "projects": {
        "detail": [
            [
               "ระบบยืมชุดอุปกรณ์, โดยเราเก็บข้อมูลว่าสินค้าแต่ละ Model ใช้วัสดุ-อุปกรณ์อะไรบ้าง เช่น สี, ชื่อ Model, โครงสร้าง Model หรือตำแหน่งของอุปกรณ์ในคลังสินค้า เพื่อช่วยพนักงานและเพิ่มผลผลิต, นอกจากนี้เรายังเก็บข้อมูลการยืม-คืน ใครเป็นคนยืม, คนให้ยืม, คนรับคืน, ยืม-คืนเมื่อไหร่, สถานะของแต่ละการยืม และรายงานเป็นไฟล์ PDF หรือ CSV",
               "Mini project สำหรับศึกษาการใช้งาน NextAuth และ Docker",
               "Mini project สำหรับศึกษาการใช้งาน Prisma และ Docker",
               "Mini project สำหรับศึกษาการใช้งาน Express.js และ MongoDB, CRUD project เก็บข้อมูลใน MongoDB",
               "ระบบติดตามกระบวนการทำงาน, ว่าสินค้านั้นกำลังทำอะไรหรืออยู่ที่ไหน"
            ],
            [
                "Mini project สำหรับศึกษาการใช้งาน C# Dotnet framework และ Entity Framework"
            ],
            [
                "Mini project สำหรับวิชา OOSE Lab"
            ],
            [
                "Mini project สำหรับวิชา Computer Software Laboratory"
            ],
            [
                "Mini project สำหรับศึกษา session ใน PHP และเป็นส่วนหนึ่งในวิชา Server programming",
               "ระบบติดตามกระบวนการทำงาน, ว่าสินค้านั้นกำลังทำอะไรหรืออยู่ที่ไหน"
            ],
            [
                "Mini IoT project สำหรับวัดไฟฟ้า AC เช่น แรงดัน, กระแส or กำลัง และแสดงในรูปแบบกราฟ dashboard ใน InfluxDB"
            ],
            [
                "Mini project แสดงข้อมูลเกี่ยวกับตัวเอง",
                "Mini project เครื่องคิดเลข"
            ]
        ],
        "restrict": "ความลับขององค์กร"
    }
}
